pmo-dataset/graphviz/45.dot
digraph G {
  rankdir=LR;  
  node [shape=box];

  "Open E-Shop Homepage" -> "customer logs into\nE-Shop";
  "customer logs into\nE-Shop" -> "customer credentials\nbeing checked by\nsystem";
  "customer credentials\nbeing checked by\nsystem" -> "succesful login?";
  "customer selects a\nproduct" -> "customer adds\nproduct to shopping\ncart";
  "customer adds\nproduct to shopping\ncart" -> "customer saves\nproduct";
  "customer saves\nproduct" -> "customer checks if\nproduct was already\nselected";
  "customer checks if\nproduct was already\nselected" -> "has customer\nselected all desired\nproducts?";
  "ParallelGateway_1" -> "Payment is prepared\nby system";
  "ParallelGateway_1" -> "Shipment is prepared\nby system";
  "ParallelGateway_2" -> "order is being\nfinished by system";
  "customer enters\npayment data" -> "ParallelGateway_3";
  "Payment is prepared\nby system" -> "ParallelGateway_4";
  "Shipment is prepared\nby system" -> "ParallelGateway_4";
  "ParallelGateway_4" -> "customer enters\npayment data";
  "ParallelGateway_3" -> "customer enters\nshipping address";
  "customer enters\nshipping address" -> "if shipping adress\n== billing adress?";
  "customer enters an\nindependent billing\nadress" -> "ExclusiveGateway_1";
  "ExclusiveGateway_1" -> "ParallelGateway_2";
  "if shipping adress\n== billing adress?" -> "ExclusiveGateway_1" [label="Yes"];
  "if shipping adress\n== billing adress?" -> "customer enters an\nindependent billing\nadress" [label="No"];
  "has customer\nselected all desired\nproducts?" -> "ParallelGateway_1" [label="Yes"];
  "order is being\nfinished by system" -> "ExclusiveGateway_2";
  "ExclusiveGateway_2" -> "Close E-Shop\nHomepage";
  "ExclusiveGateway_3" -> "customer selects a\nproduct";
  "succesful login?" -> "ExclusiveGateway_3" [label="Yes"];
  "ParallelGateway_3" -> "customer waits until\nbank confirms\npayment";
  "customer waits until\nbank confirms\npayment" -> "ParallelGateway_2";
  "has customer\nselected all desired\nproducts?" -> "ExclusiveGateway_3" [label="No"];
  "succesful login?" -> "ExclusiveGateway_2" [label="No"];

  "Open E-Shop Homepage" [shape=circle];
  "Close E-Shop\nHomepage" [shape=circle, penwidth=4];
  "succesful login?" [shape=diamond];
  "has customer\nselected all desired\nproducts?" [shape=diamond];
  "if shipping adress\n== billing adress?" [shape=diamond];
  "ExclusiveGateway_1" [label="X", shape=diamond];
  "ExclusiveGateway_2" [label="X", shape=diamond];
  "ExclusiveGateway_3" [label="X", shape=diamond];
  "ParallelGateway_1" [label="+", shape=diamond];
  "ParallelGateway_2" [label="+", shape=diamond];
  "ParallelGateway_3" [label="+", shape=diamond];
  "ParallelGateway_4" [label="+", shape=diamond];
}
